todoeyear-web/src/tests/jmeter-test.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: manage reminders-Selenium
  blazegrid: true
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: manage reminders-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  manage reminders-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1050,771)
      - go(http://localhost:8080/todoeyear-web/login.xhtml)
      - clickByID(email)
      - typeByID(email): "lucasliet@test.com"
      - typeByID(senha): "123"
      - clickByID(login-button)
      - clickByID(new-reminder-page-button)
      - clickByID(reminder_title)
      - typeByID(reminder_title): "New Reminder by blazemeter"
      - clickByXPath(//form[@id='formreminder']/fieldset/div[2]/label)
      - clickByXPath((//button[@type='button'])[33])
      - clickByCSS(button.btn-flat.datepicker-done.waves-effect)
      - clickByID(reminder_body)
      - typeByID(reminder_body): "reminder added by blazemeter macro recording"
      - clickByID(save-button)
      - clickByID(reminder_body)
      - clickByID(reminder_body)
      - doubleClickByID(reminder_body)
      - typeByID(reminder_body): "reminder edited by blazemeter macro recording"
      - clickByID(save-button)
      - clickByID(new-reminder-page-button)
      - clickByID(reminder_title)
      - typeByID(reminder_title): "New Reminder by blazemeter"
      - clickByID(reminder_deadline)
      - clickByXPath((//button[@type='button'])[33])
      - clickByCSS(button.btn-flat.datepicker-done.waves-effect)
      - clickByID(reminder_title)
      - typeByID(reminder_title): "reminder2"
      - typeByID(reminder_body): "reminder2"
      - clickByID(save-button)
      - clickByXPath(//form[@id='j_idt14']/div[3]/div)
      - clickByXPath(//form[@id='j_idt14']/div[3]/div)
      - doubleClickByXPath(//form[@id='j_idt14']/div[3]/div)
      - clickByID(reminder_body)
      - typeByID(reminder_body): "reminder2 edited"
      - clickByID(save-button)
      - clickByCSS(i.material-icons.white-text.logout-button)
      - clickByID(signup-button)
      - clickByID(email)
      - typeByID(email): "usuariotest3213@test.com"
      - typeByID(senha): "123"
      - clickByID(signup-button)

  manage reminders-Http:
    headers:
      Upgrade-Insecure-Requests: '1'
      User-Agent: 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/88.0.4324.96 Safari/537.36'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:8080/todoeyear-web/login.xhtml'
            method: POST
            label: 'http://localhost:8080/todoeyear-web/login.xhtml'
            think-time: 0ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              javax.faces.ViewState: '7728438777579091978:-7834262429692849953'
              login: login
              'login:j_idt13': lucasliet@test.com
              'login:j_idt15': '123'
              'login:j_idt17': ''
          - url: 'http://localhost:8080/todoeyear-web/home.xhtml'
            method: POST
            label: 'http://localhost:8080/todoeyear-web/home.xhtml'
            think-time: 4792ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              j_idt11: j_idt11
              'j_idt11:j_idt12': ''
              javax.faces.ViewState: '-303581410956107372:6599515466869764616'
          - url: 'http://localhost:8080/todoeyear-web/new.xhtml'
            method: POST
            label: 'http://localhost:8080/todoeyear-web/new.xhtml'
            think-time: 25698ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              formreminder: formreminder
              'formreminder:j_idt14': New Reminder by blazemeter
              'formreminder:j_idt16': 31/01/2021
              'formreminder:j_idt18': reminder added by blazemeter macro recording
              'formreminder:j_idt20': ''
              javax.faces.ViewState: '6793006713291717372:-6439120042624830203'
          - url: 'http://localhost:8080/todoeyear-web/home.xhtml'
            method: POST
            label: 'http://localhost:8080/todoeyear-web/home.xhtml'
            think-time: 4076ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              j_idt14: j_idt14
              'j_idt14:j_idt16:2:j_idt21': 'j_idt14:j_idt16:2:j_idt21'
              javax.faces.ViewState: '-6954264683855465310:2754031741287917210'
          - url: 'http://localhost:8080/todoeyear-web/new.xhtml'
            method: POST
            label: 'http://localhost:8080/todoeyear-web/new.xhtml'
            think-time: 11581ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              formreminder: formreminder
              'formreminder:j_idt14': New Reminder by blazemeter
              'formreminder:j_idt16': 31/01/2021
              'formreminder:j_idt18': reminder edited by blazemeter macro recording
              'formreminder:j_idt20': ''
              javax.faces.ViewState: '-2451577312858731326:85106455313473812'
          - url: 'http://localhost:8080/todoeyear-web/home.xhtml'
            method: POST
            label: 'http://localhost:8080/todoeyear-web/home.xhtml'
            think-time: 3883ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              j_idt14: j_idt14
              'j_idt14:j_idt16:2:j_idt25': 'j_idt14:j_idt16:2:j_idt25'
              javax.faces.ViewState: '-6016692877077002772:2844963581497654533'
          - url: 'http://localhost:8080/todoeyear-web/home.xhtml'
            method: POST
            label: 'http://localhost:8080/todoeyear-web/home.xhtml'
            think-time: 1828ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              j_idt11: j_idt11
              'j_idt11:j_idt12': ''
              javax.faces.ViewState: '-6016692877077002772:-3563028297288118599'
          - url: 'http://localhost:8080/todoeyear-web/new.xhtml'
            method: POST
            label: 'http://localhost:8080/todoeyear-web/new.xhtml'
            think-time: 16999ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              formreminder: formreminder
              'formreminder:j_idt14': reminder2
              'formreminder:j_idt16': 31/01/2021
              'formreminder:j_idt18': reminder2
              'formreminder:j_idt20': ''
              javax.faces.ViewState: '-5632331557154012031:-7266684639860363986'
          - url: 'http://localhost:8080/todoeyear-web/new.xhtml'
            method: GET
            label: 'http://localhost:8080/todoeyear-web/new.xhtml'
            think-time: 1882ms
            headers: {}
            body:
              reminderId: '50'
          - url: 'http://localhost:8080/todoeyear-web/new.xhtml'
            method: POST
            label: 'http://localhost:8080/todoeyear-web/new.xhtml'
            think-time: 6459ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              formreminder: formreminder
              'formreminder:j_idt14': reminder2
              'formreminder:j_idt16': 31/01/2021
              'formreminder:j_idt18': reminder2 edited
              'formreminder:j_idt20': ''
              javax.faces.ViewState: '6720942156488895660:3881471670138359048'
          - url: 'http://localhost:8080/todoeyear-web/home.xhtml'
            method: POST
            label: 'http://localhost:8080/todoeyear-web/home.xhtml'
            think-time: 2499ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              j_idt14: j_idt14
              'j_idt14:j_idt16:2:j_idt25': 'j_idt14:j_idt16:2:j_idt25'
              javax.faces.ViewState: '7733344617778786353:4021317467188006523'
          - url: 'http://localhost:8080/todoeyear-web/home.xhtml'
            method: POST
            label: 'http://localhost:8080/todoeyear-web/home.xhtml'
            think-time: 4308ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              j_idt8: j_idt8
              'j_idt8:logout-button': 'j_idt8:logout-button'
              javax.faces.ViewState: '7733344617778786353:-5242069339678975757'
          - url: 'http://localhost:8080/todoeyear-web/login.xhtml'
            method: POST
            label: 'http://localhost:8080/todoeyear-web/login.xhtml'
            think-time: 1627ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              j_idt20: j_idt20
              'j_idt20:j_idt22': 'j_idt20:j_idt22'
              javax.faces.ViewState: '1349231082922284571:-8365498221149345294'
          - url: 'http://localhost:8080/todoeyear-web/signup.xhtml'
            method: POST
            label: 'http://localhost:8080/todoeyear-web/signup.xhtml'
            think-time: 9457ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              javax.faces.ViewState: '1349231082922284571:-2690050293953024218'
              signup: signup
              'signup:j_idt12': usuariotest3213@test.com
              'signup:j_idt14': '123'
              'signup:j_idt16': ''